system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// 1500 rpm => 0.04 s/rev. Two revolutions for smoother animation content.
endTime         0.08;

deltaT          1e-5;

// Sparse volume field dumps (disk budget). Surfaces write separately below.
writeControl    adjustableRunTime;
writeInterval   0.02;
purgeWrite      4;

writeFormat     binary;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;
maxCo           2;

functions
{
    #includeFunc Q
    #include "surfaces"
    #include "forces"
}

// ************************************************************************* //
