system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 4 ranks is a good balance on this 8-vCPU / 16 GB VM
numberOfSubdomains 4;

method          hierarchical;

hierarchicalCoeffs
{
    n               (2 2 1);
    order           xyz;
}


// ************************************************************************* //
